# Pandas - Agregacje

In [1]:
import pandas as pd

In [4]:
zmienna = 0.12345
round(zmienna, 2)
int(zmienna)

0

In [5]:
dataset = pd.read_csv('zwierzeta.csv', delimiter=',')

In [6]:
dataset

      animal  uniq_id  water_need  age
0   elephant     1001         500    5
1   elephant     1002         600    6
2   elephant     1003         550    4
3      tiger     1004         300    7
4      tiger     1005         320    8
5      tiger     1006         330    3
6      tiger     1007         290   10
7      tiger     1008         310    4
8      zebra     1009         200    5
9      zebra     1010         220   11
10     zebra     1011         240    9
11     zebra     1012         230   10
12     zebra     1013         220   15
13     zebra     1014         100   10
14     zebra     1015          80   10
15      lion     1016         420   10
16      lion     1017         600   10
17      lion     1018         500   11
18      lion     1019         390   11
19  kangaroo     1020         410   12
20  kangaroo     1021         430   11
21  kangaroo     1022         410   12

In [7]:
# Przestawienie kolumny
dataset = dataset[['uniq_id', 'animal', 'age', 'water_need']]
dataset

    uniq_id    animal  age  water_need
0      1001  elephant    5         500
1      1002  elephant    6         600
2      1003  elephant    4         550
3      1004     tiger    7         300
4      1005     tiger    8         320
5      1006     tiger    3         330
6      1007     tiger   10         290
7      1008     tiger    4         310
8      1009     zebra    5         200
9      1010     zebra   11         220
10     1011     zebra    9         240
11     1012     zebra   10         230
12     1013     zebra   15         220
13     1014     zebra   10         100
14     1015     zebra   10          80
15     1016      lion   10         420
16     1017      lion   10         600
17     1018      lion   11         500
18     1019      lion   11         390
19     1020  kangaroo   12         410
20     1021  kangaroo   11         430
21     1022  kangaroo   12         410

In [8]:
dataset.count()

uniq_id       22
animal        22
age           22
water_need    22
dtype: int64

In [9]:
dataset.animal.count()

22

In [10]:
dataset.shape

(22, 4)

In [11]:
dataset[dataset.animal == 'tiger'][['water_need', 'animal']]

   water_need animal
3         300  tiger
4         320  tiger
5         330  tiger
6         290  tiger
7         310  tiger

In [12]:
dataset[dataset.animal == 'tiger'].water_need.sum()

1550

In [13]:
dataset.min()

uniq_id           1001
animal        elephant
age                  3
water_need          80
dtype: object

In [14]:
dataset.max()

uniq_id        1022
animal        zebra
age              15
water_need      600
dtype: object

In [15]:
dataset.water_need.max()

600

In [16]:
dataset['water_need'].max()

600

In [17]:
dataset[dataset.water_need < 400].max()

uniq_id        1019
animal        zebra
age              15
water_need      390
dtype: object

In [18]:
dataset[(dataset.animal == 'tiger') & (dataset.water_need > 300)].uniq_id.max()

1008

In [19]:
dataset[dataset.animal == 'zebra'].mean()

uniq_id       1012.000000
age             10.000000
water_need     184.285714
dtype: float64

In [20]:
dataset[dataset['uniq_id'] > 1010].water_need.median()

400.0

In [21]:
dataset.groupby('animal').uniq_id.count()

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
Name: uniq_id, dtype: int64

In [22]:
# Znaleźć nazwę zwierzęcia, które pije najwięcej wody
dataset[dataset.water_need == dataset.water_need.max()].animal

1     elephant
16        lion
Name: animal, dtype: object

In [23]:
# Podać uniq_id i ilość pitej wody dla każdego słonia lub lwa
dataset[(dataset.animal == 'lion') | (dataset.animal == 'elephant')][['water_need','uniq_id']]

    water_need  uniq_id
0          500     1001
1          600     1002
2          550     1003
15         420     1016
16         600     1017
17         500     1018
18         390     1019

In [24]:
# Znaleźć uniq_id dla zebry pijącej mniej niz 100 l wody
dataset[(dataset.animal == 'zebra') & (dataset.water_need < 100)].uniq_id

14    1015
Name: uniq_id, dtype: int64

In [25]:
# Ile zwierząt spożywa więcej niż 400 l wody 
dataset[dataset.water_need > 400].count().animal

9

In [26]:
# Ile wody spożywają wszystkie zebry o uniq_id większym od 1000
dataset[(dataset.animal == 'zebra') & (dataset.uniq_id > 1000)].water_need.sum()

1290

In [27]:
# Ile wody średnio spożywa jedno zwierze
dataset.water_need.mean()

347.72727272727275

In [28]:
# Ile wody średnio spożywa jedna zebra
dataset[dataset.animal == 'zebra'].water_need.mean()

184.28571428571428

In [29]:
# Obliczyć średnią spożywaną ilość wody dla każdego gatunku zwierząt
dataset.groupby('animal').mean().water_need

animal
elephant    550.000000
kangaroo    416.666667
lion        477.500000
tiger       310.000000
zebra       184.285714
Name: water_need, dtype: float64

In [30]:
# Spośród zwierząt o uniq_id większym niż 1005, zwierzęta jakiego gatunku i w jakim wieku stanowią najliczniejszą grupę
data = dataset[dataset.uniq_id > 1005].groupby(['animal', 'age']).count().uniq_id
data[data == data.max()]
data.idxmax() #index dla największego elementu

('zebra', 10)

In [31]:
# Ile jest zwierząt każdego gatunku
dataset.groupby('animal').count().uniq_id

animal
elephant    3
kangaroo    3
lion        4
tiger       5
zebra       7
Name: uniq_id, dtype: int64

In [32]:
# Zebr o jakim wieku, jest najwięcej
dane = dataset[dataset.animal == 'zebra'].groupby('age').count().uniq_id
print(dane[dane == dane.max()])
print(dane.idxmax())

age
10    3
Name: uniq_id, dtype: int64
10

# Pandas - Tabele

In [33]:
import numpy as np
import pandas as pd

In [34]:
# Uzupełnianie pustych wartości
df = pd.DataFrame([{'a': 0, 'b': 1}, {'a': 2, 'c': 3}, {'a': 4, 'c': 5}])
df

   a    b    c
0  0  1.0  NaN
1  2  NaN  3.0
2  4  NaN  5.0

In [35]:
df.loc[1, 'b'] = 7

In [36]:
df

   a    b    c
0  0  1.0  NaN
1  2  7.0  3.0
2  4  NaN  5.0

In [37]:
#df.dropna(#kolumna,wiersz) - usuwanie danych NaN
df.fillna(5)

   a    b    c
0  0  1.0  5.0
1  2  7.0  3.0
2  4  5.0  5.0

In [38]:
df.fillna(method='bfill', axis=0)

   a    b    c
0  0  1.0  3.0
1  2  7.0  3.0
2  4  NaN  5.0

In [39]:
df.loc[1, 'b'] = np.nan

In [40]:
df.fillna({'b': 10})

   a     b    c
0  0   1.0  NaN
1  2  10.0  3.0
2  4  10.0  5.0

In [41]:
df.fillna({'b': 10}, limit=1)

   a     b    c
0  0   1.0  NaN
1  2  10.0  3.0
2  4   NaN  5.0

In [42]:
df['c'].fillna(df['c'].mean(), limit=1, inplace=True)
df

   a    b    c
0  0  1.0  4.0
1  2  NaN  3.0
2  4  NaN  5.0

In [43]:
np.random.randn(5, 3)

array([[-1.0339259 , -0.90980446, -3.17218365],
       [ 1.39087798,  0.08127836,  0.93720225],
       [-1.08669761, -0.86059199,  0.20386428],
       [ 0.66092586,  0.14362181, -0.39820155],
       [ 0.13429883,  0.08347098, -0.84069342]])

In [44]:
df = pd.DataFrame(np.random.randn(5, 3), columns=['col1','col2','col3'])
df

       col1      col2      col3
0  1.050191 -1.856270  0.196101
1  0.489482  0.887928 -1.659237
2 -0.055233 -0.815641 -0.572374
3  0.058853 -0.661096 -0.905532
4  0.458213  1.787624  0.495700

In [45]:
# Transponowanie
df.T

             0         1         2         3         4
col1  1.050191  0.489482 -0.055233  0.058853  0.458213
col2 -1.856270  0.887928 -0.815641 -0.661096  1.787624
col3  0.196101 -1.659237 -0.572374 -0.905532  0.495700

In [46]:
# Dodanie kolumny
df['col4'] = ['wartosc 4', 'wartosc 2', 'w1', 'w3', 'w5']
df

       col1      col2      col3       col4
0  1.050191 -1.856270  0.196101  wartosc 4
1  0.489482  0.887928 -1.659237  wartosc 2
2 -0.055233 -0.815641 -0.572374         w1
3  0.058853 -0.661096 -0.905532         w3
4  0.458213  1.787624  0.495700         w5

In [47]:
# Dodanie kolumny w żądanym miejscu
df.insert(1, 'col6', ['a', 'b', 'c', 'd', 'e'])
df

       col1 col6      col2      col3       col4
0  1.050191    a -1.856270  0.196101  wartosc 4
1  0.489482    b  0.887928 -1.659237  wartosc 2
2 -0.055233    c -0.815641 -0.572374         w1
3  0.058853    d -0.661096 -0.905532         w3
4  0.458213    e  1.787624  0.495700         w5

In [48]:
df['sum'], df['diff'] = df['col1'] + df['col2'], df['col1'] - df['col2']
df

       col1 col6      col2      col3       col4       sum      diff
0  1.050191    a -1.856270  0.196101  wartosc 4 -0.806079  2.906462
1  0.489482    b  0.887928 -1.659237  wartosc 2  1.377409 -0.398446
2 -0.055233    c -0.815641 -0.572374         w1 -0.870875  0.760408
3  0.058853    d -0.661096 -0.905532         w3 -0.602244  0.719949
4  0.458213    e  1.787624  0.495700         w5  2.245837 -1.329410

In [49]:
# Usunięcie kolumny
removed = df.pop('diff')
print(df)
print('\n')
print(removed)

       col1 col6      col2      col3       col4       sum
0  1.050191    a -1.856270  0.196101  wartosc 4 -0.806079
1  0.489482    b  0.887928 -1.659237  wartosc 2  1.377409
2 -0.055233    c -0.815641 -0.572374         w1 -0.870875
3  0.058853    d -0.661096 -0.905532         w3 -0.602244
4  0.458213    e  1.787624  0.495700         w5  2.245837


0    2.906462
1   -0.398446
2    0.760408
3    0.719949
4   -1.329410
Name: diff, dtype: float64

In [50]:
df.drop('sum', axis=1)
df

       col1 col6      col2      col3       col4       sum
0  1.050191    a -1.856270  0.196101  wartosc 4 -0.806079
1  0.489482    b  0.887928 -1.659237  wartosc 2  1.377409
2 -0.055233    c -0.815641 -0.572374         w1 -0.870875
3  0.058853    d -0.661096 -0.905532         w3 -0.602244
4  0.458213    e  1.787624  0.495700         w5  2.245837

In [51]:
df = df.drop('sum', axis=1)
df

       col1 col6      col2      col3       col4
0  1.050191    a -1.856270  0.196101  wartosc 4
1  0.489482    b  0.887928 -1.659237  wartosc 2
2 -0.055233    c -0.815641 -0.572374         w1
3  0.058853    d -0.661096 -0.905532         w3
4  0.458213    e  1.787624  0.495700         w5

In [52]:
df.drop('col4', axis=1, inplace=True)
df

       col1 col6      col2      col3
0  1.050191    a -1.856270  0.196101
1  0.489482    b  0.887928 -1.659237
2 -0.055233    c -0.815641 -0.572374
3  0.058853    d -0.661096 -0.905532
4  0.458213    e  1.787624  0.495700

In [53]:
df.loc[2] #wyświetla wiersz 2
df.loc[2:4] #wyświetla wiersze 2,3,4

       col1 col6      col2      col3
2 -0.055233    c -0.815641 -0.572374
3  0.058853    d -0.661096 -0.905532
4  0.458213    e  1.787624  0.495700

In [54]:
# Dodanie wiersza
print(df)
print('\n')
df.loc[2] = ['a', 'b', 'c', 'd'] #zamiana wartości
print(df)

       col1 col6      col2      col3
0  1.050191    a -1.856270  0.196101
1  0.489482    b  0.887928 -1.659237
2 -0.055233    c -0.815641 -0.572374
3  0.058853    d -0.661096 -0.905532
4  0.458213    e  1.787624  0.495700


        col1 col6      col2      col3
0    1.05019    a  -1.85627  0.196101
1   0.489482    b  0.887928  -1.65924
2          a    b         c         d
3  0.0588525    d -0.661096 -0.905532
4   0.458213    e   1.78762    0.4957

In [55]:
df.append({'col1': 0, 'col2': 1, 'col3': 2, 'col5': 'f'}, ignore_index=True)

        col1 col6      col2      col3 col5
0    1.05019    a  -1.85627  0.196101  NaN
1   0.489482    b  0.887928  -1.65924  NaN
2          a    b         c         d  NaN
3  0.0588525    d -0.661096 -0.905532  NaN
4   0.458213    e   1.78762    0.4957  NaN
5          0  NaN         1         2    f

In [56]:
df = df[['col1', 'col2', 'col3']]
df

        col1      col2      col3
0    1.05019  -1.85627  0.196101
1   0.489482  0.887928  -1.65924
2          a         c         d
3  0.0588525 -0.661096 -0.905532
4   0.458213   1.78762    0.4957

In [57]:
# Usuwanie wiersza
df = df.drop(2)
df

        col1      col2      col3
0    1.05019  -1.85627  0.196101
1   0.489482  0.887928  -1.65924
3  0.0588525 -0.661096 -0.905532
4   0.458213   1.78762    0.4957

In [58]:
df.drop(df.index[0:2], inplace=True)
df

        col1      col2      col3
3  0.0588525 -0.661096 -0.905532
4   0.458213   1.78762    0.4957

In [59]:
# Wywoływanie własnej lub zewnętrznej funkcji na tabelach
# 1. Na poziomie tabeli: metoda pipe()

In [60]:
def adder(element1, element2):
    return element1 + element2

In [61]:
df = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -0.188614 -0.376829 -1.230093
1  0.756311  3.020568  0.999564
2  1.292977 -0.168546 -2.861438
3 -0.962895 -0.233950  0.186780
4  0.633508 -0.863654 -0.145006

In [62]:
df.pipe(adder, 2) #wywołanie funkcji dla każdego rekordu tabeli -> adder(rekord, 2) x 15 razy

       col1      col2      col3
0  1.811386  1.623171  0.769907
1  2.756311  5.020568  2.999564
2  3.292977  1.831454 -0.861438
3  1.037105  1.766050  2.186780
4  2.633508  1.136346  1.854994

In [63]:
def multiplier(element1, element2):
    return element1 * element2

In [64]:
print('Oryginalna tabela')
print(df)

print('\nKazdy element + 2')
print(df.pipe(adder, 2))

print('\nKazdy element * 2')
print(df.pipe(multiplier, 2))

Oryginalna tabela
       col1      col2      col3
0 -0.188614 -0.376829 -1.230093
1  0.756311  3.020568  0.999564
2  1.292977 -0.168546 -2.861438
3 -0.962895 -0.233950  0.186780
4  0.633508 -0.863654 -0.145006

Kazdy element + 2
       col1      col2      col3
0  1.811386  1.623171  0.769907
1  2.756311  5.020568  2.999564
2  3.292977  1.831454 -0.861438
3  1.037105  1.766050  2.186780
4  2.633508  1.136346  1.854994

Kazdy element * 2
       col1      col2      col3
0 -0.377228 -0.753658 -2.460186
1  1.512623  6.041135  1.999128
2  2.585954 -0.337091 -5.722876
3 -1.925789 -0.467899  0.373560
4  1.267016 -1.727307 -0.290013

In [65]:
df.pipe(np.mean)

col1    0.306258
col2    0.275518
col3   -0.610039
dtype: float64

In [66]:
df.pipe(np.mean, axis=1)

0   -0.598512
1    1.592148
2   -0.579002
3   -0.336688
4   -0.125051
dtype: float64

In [67]:
np.mean(df, axis=1)

0   -0.598512
1    1.592148
2   -0.579002
3   -0.336688
4   -0.125051
dtype: float64

In [68]:
# 2. Na poziomie wiersza lub kolumny: metoda apply()

In [69]:
print(df)
df.apply(np.mean)

       col1      col2      col3
0 -0.188614 -0.376829 -1.230093
1  0.756311  3.020568  0.999564
2  1.292977 -0.168546 -2.861438
3 -0.962895 -0.233950  0.186780
4  0.633508 -0.863654 -0.145006

col1    0.306258
col2    0.275518
col3   -0.610039
dtype: float64

In [70]:
#def nazwa_funkcji(argumenty):
# ciało_funkcji (zwracane argumenty)

#lambda argumenty: instrukcje
#moja_funkcja = lambda x: x * 2

df.apply(lambda x: x.max() - x.min()) #działanie na kolumnach/wierszach
df.col1.apply(lambda x: x + 5) #działanie na komórkach

0    4.811386
1    5.756311
2    6.292977
3    4.037105
4    5.633508
Name: col1, dtype: float64

In [71]:
# 3. Na poziomie pojedynczej komórki: metody applymap(), map()

In [72]:
print(df)
df.applymap(lambda x: x + 5)

       col1      col2      col3
0 -0.188614 -0.376829 -1.230093
1  0.756311  3.020568  0.999564
2  1.292977 -0.168546 -2.861438
3 -0.962895 -0.233950  0.186780
4  0.633508 -0.863654 -0.145006

       col1      col2      col3
0  4.811386  4.623171  3.769907
1  5.756311  8.020568  5.999564
2  6.292977  4.831454  2.138562
3  4.037105  4.766050  5.186780
4  5.633508  4.136346  4.854994

In [73]:
df['col4'] = df['col1'].map(lambda x: x + 5) - df['col2'] * 2
df

       col1      col2      col3      col4
0 -0.188614 -0.376829 -1.230093  5.565044
1  0.756311  3.020568  0.999564 -0.284824
2  1.292977 -0.168546 -2.861438  6.630068
3 -0.962895 -0.233950  0.186780  4.505005
4  0.633508 -0.863654 -0.145006  7.360815

In [74]:
# Sortowanie - po nazwach / indeksach lub wartościach

In [75]:
# Sortowanie według nazw wierszy
unsorted_df = pd.DataFrame(
    np.random.randn(10, 2), index=[1, 4, 6, 2, 3, 5, 9, 8, 0, 7], columns = ['col2', 'col1'])
print(unsorted_df)
print('\n')

sorted_df = unsorted_df.sort_index()
print(sorted_df)

       col2      col1
1 -0.440937  0.473464
4  1.073079 -1.096894
6  0.027544 -0.028865
2 -0.240520  1.317430
3  1.039196 -2.277410
5  0.722259 -0.241022
9 -0.550503  0.332716
8 -0.324436 -1.217903
0  1.173988  0.825142
7  0.110336 -0.586030


       col2      col1
0  1.173988  0.825142
1 -0.440937  0.473464
2 -0.240520  1.317430
3  1.039196 -2.277410
4  1.073079 -1.096894
5  0.722259 -0.241022
6  0.027544 -0.028865
7  0.110336 -0.586030
8 -0.324436 -1.217903
9 -0.550503  0.332716

In [76]:
sorted_df = unsorted_df.sort_index(ascending=False)
print(sorted_df)

       col2      col1
9 -0.550503  0.332716
8 -0.324436 -1.217903
7  0.110336 -0.586030
6  0.027544 -0.028865
5  0.722259 -0.241022
4  1.073079 -1.096894
3  1.039196 -2.277410
2 -0.240520  1.317430
1 -0.440937  0.473464
0  1.173988  0.825142

In [77]:
# Sortowanie według nazw kolumn
 
sorted_df = unsorted_df.sort_index(axis=1)
print(sorted_df)

       col1      col2
1  0.473464 -0.440937
4 -1.096894  1.073079
6 -0.028865  0.027544
2  1.317430 -0.240520
3 -2.277410  1.039196
5 -0.241022  0.722259
9  0.332716 -0.550503
8 -1.217903 -0.324436
0  0.825142  1.173988
7 -0.586030  0.110336

In [78]:
sorted_df = unsorted_df.sort_index(axis=1).sort_index(ascending=False)
print(sorted_df)

       col1      col2
9  0.332716 -0.550503
8 -1.217903 -0.324436
7 -0.586030  0.110336
6 -0.028865  0.027544
5 -0.241022  0.722259
4 -1.096894  1.073079
3 -2.277410  1.039196
2  1.317430 -0.240520
1  0.473464 -0.440937
0  0.825142  1.173988

In [81]:
# Sortowanie po wartościach
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1', ascending=True)
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [82]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by=['col1', 'col2'])
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1

In [83]:
unsorted_df = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
sorted_df = unsorted_df.sort_values(by='col1', kind='mergesort')
print(unsorted_df)
print('\n')
print(sorted_df)

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4


   col1  col2
1     1     3
2     1     2
3     1     4
0     2     1

In [84]:
d1 = pd.DataFrame(
    {
        'id':[1,2,3,4,5],
        'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'subject_id':['sub1','sub2','sub4','sub6','sub5']
    }
)
d2 = pd.DataFrame(
    {
        'id':[1,2,3,4,5],
        'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'subject_id':['sub2','sub4','sub3','sub6','sub5']
    }
)
print(d1)
print('\n') #nowa_linia
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [85]:
pd.merge(d1, d2, on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [86]:
pd.merge(d1, d2, on=['id','subject_id'])

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [87]:
print(d1)
print('\n')
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [88]:
pd.merge(d1, d2, on='subject_id', how='left')

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

In [89]:
pd.merge(d1, d2, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

In [90]:
print(d1)
print('\n')
print(d2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [91]:
pd.merge(d1, d2, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

In [92]:
pd.merge(d1, d2, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [93]:
# Obiekty rzadkie
ts = pd.Series(np.random.randn(10))
ts[2:-2] = np.nan
print(ts)

0   -0.968226
1    0.594798
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8    0.415781
9    1.091146
dtype: float64

In [94]:
ts.to_dense()

C:\Users\Student222316\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: DataFrame/Series.to_dense is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

0   -0.968226
1    0.594798
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8    0.415781
9    1.091146
dtype: float64

In [95]:
df = pd.DataFrame(np.random.randn(10000, 4))
df.loc[:9998] = np.nan
sdf = df.to_sparse()
sdf

C:\Users\Student222316\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: DataFrame.to_sparse is deprecated and will be removed in a future version
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Student222316\Anaconda3\lib\site-packages\pandas\core\sparse\frame.py:745: FutureWarning: SparseDataFrame is deprecated and will be removed in a future version.
Use a regular DataFrame whose columns are SparseArrays instead.

See http://pandas.pydata.org/pandas-docs/stable/user_guide/sparse.html#migrating for more.

  default_fill_value=self._default_fill_value,
C:\Users\Student222316\Anaconda3\lib\site-packages\pandas\core\frame.py:3456: FutureWarning: SparseSeries is deprecated and will be removed in a future version.
Use a Series with sparse values instead.

    >>> series = pd.Series(pd.SparseArray(...))

See http://pandas.pydata.org/pandas-docs/stable/user_guide/sparse.html#migrating for more.

  return klass(values, index=self.index, name=items, fastpath=True)
C:\Users\Student222316\Anaconda3\lib\site-packages\pandas\core\sparse\frame.py:721: FutureWarning: SparseDataFrame is deprecated and will be removed in a future version.
Use a regular DataFrame whose columns are SparseArrays instead.

See http://pandas.pydata.org/pandas-docs/stable/user_guide/sparse.html#migrating for more.

  default_fill_value=self._default_fill_value,
C:\Users\Student222316\Anaconda3\lib\site-packages\pandas\core\generic.py:392: FutureWarning: SparseDataFrame is deprecated and will be removed in a future version.
Use a regular DataFrame whose columns are SparseArrays instead.

See http://pandas.pydata.org/pandas-docs/stable/user_guide/sparse.html#migrating for more.

  return cls(data, **kwargs)

             0         1         2         3
0          NaN       NaN       NaN       NaN
1          NaN       NaN       NaN       NaN
2          NaN       NaN       NaN       NaN
3          NaN       NaN       NaN       NaN
4          NaN       NaN       NaN       NaN
...        ...       ...       ...       ...
9995       NaN       NaN       NaN       NaN
9996       NaN       NaN       NaN       NaN
9997       NaN       NaN       NaN       NaN
9998       NaN       NaN       NaN       NaN
9999 -0.254142 -0.069076 -0.250734 -0.939732

[10000 rows x 4 columns]

In [96]:
sdf.to_dense()

             0         1         2         3
0          NaN       NaN       NaN       NaN
1          NaN       NaN       NaN       NaN
2          NaN       NaN       NaN       NaN
3          NaN       NaN       NaN       NaN
4          NaN       NaN       NaN       NaN
...        ...       ...       ...       ...
9995       NaN       NaN       NaN       NaN
9996       NaN       NaN       NaN       NaN
9997       NaN       NaN       NaN       NaN
9998       NaN       NaN       NaN       NaN
9999 -0.254142 -0.069076 -0.250734 -0.939732

[10000 rows x 4 columns]

In [97]:
df1 = pd.DataFrame([[0, 1, 2, 20], [3, 4, 5, 21], [6, 7, 8, 22], [9, 10, 11, 23]])
df2 = df1 * -1
print(df1)
print('\n')
print(df2)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

In [57]:
# Dla każdego wiersza tabeli dodać maksymalną wartość z kolumny o tym samym indeksie co ten wiersz,
# ale pochodzącej z drugiej tabeli
n = -1
def get_max(row):
    global n
    n = n + 1
    if n == 0:
        return row
    element = df2[df2.columns[n - 1]].max()
    return row + element

print(df1)
print('\n')
print(df2)
df1.apply(get_max, axis=1)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

    0   1  2   3
0   0   1  2  20
1   2   3  4  20
2   4   5  6  20
3 -11 -10 -9   3

In [ ]:
my_dict = {}

def dodaj_wartosc(imie, wzrost):
    global my_dict
    my_dict[imie] = wzrost

In [58]:
# Do 1-szego wiersza macerzy dodać 1, do 2-go 2, itd.
n = -1
def get_max(row):
    global n
    n += 1
    if n == 0:
        return row
    element = n
    return row + element

print(df1)
print('\n')
print(df2)
df1.apply(get_max, axis=1)

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


   0   1   2   3
0  0  -1  -2 -20
1 -3  -4  -5 -21
2 -6  -7  -8 -22
3 -9 -10 -11 -23

    0   1   2   3
0   1   2   3  21
1   5   6   7  23
2   9  10  11  25
3  13  14  15  27

In [59]:
# Napisać funkcję do transponowania macierzy
def transpose(matrix):
    result = pd.DataFrame(index=matrix.columns, columns=matrix.index)
    for i, column in enumerate(matrix):
        result.loc[i] = matrix[column]
    return result

print(df1)
print('\n')
print(transpose(df1))

   0   1   2   3
0  0   1   2  20
1  3   4   5  21
2  6   7   8  22
3  9  10  11  23


    0   1   2   3
0   0   3   6   9
1   1   4   7  10
2   2   5   8  11
3  20  21  22  23

In [99]:
df1 = pd.DataFrame([{'a': 0, 'b': 1}, {'a': 2, 'c': 3}, {'a': 4, 'c': 5}])
df2 = pd.DataFrame([{'a': 6, 'b': 7}, {'a': 8, 'b': 9}, {'a': 10, 'c': 10}])

In [61]:
df1

   a    b    c
0  0  1.0  NaN
1  2  NaN  3.0
2  4  NaN  5.0

In [62]:
df2

    a    b     c
0   6  7.0   NaN
1   8  9.0   NaN
2  10  NaN  10.0

In [100]:
# Uzupełnić puste wartości dla 'b' w df1 wstawiając średnią z 'b' obliczoną dla df2
df1['b'].fillna(df2['b'].mean())

0    1.0
1    8.0
2    8.0
Name: b, dtype: float64

In [101]:
# Uzupełnić puste wartości dla 'c' w df2 wstawiając średnią różnicę pomiędzy z 'a' i 'b' obliczoną dla df1
df1['b'].fillna((df2['a'] - df2['b']).mean())

0    1.0
1   -1.0
2   -1.0
Name: b, dtype: float64

# Pandas - Statystyka

In [102]:
import numpy as np
import pandas as pd

In [103]:
# Procent przyrostu danych
s = pd.Series([1,2,3,4,5,4])
s

0    1
1    2
2    3
3    4
4    5
5    4
dtype: int64

In [104]:
print(s.pct_change())

0         NaN
1    1.000000
2    0.500000
3    0.333333
4    0.250000
5   -0.200000
dtype: float64

In [105]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [106]:
df.pct_change()

     0    1    2
0  NaN  NaN  NaN
1  3.0  1.5  1.0

In [107]:
df.pct_change(axis=1)

    0     1    2
0 NaN  1.00  0.5
1 NaN  0.25  0.2

In [108]:
# Kowariancja
s1 = pd.Series(np.random.randn(10))
s2 = pd.Series(np.random.randn(10))
print(s1)
print('\n')
print(s2)

0   -0.654162
1   -0.482085
2    0.380229
3   -0.175453
4   -0.393302
5    0.459031
6    0.288713
7    1.011749
8    0.541453
9    1.089227
dtype: float64


0    0.104320
1   -0.292708
2    0.726840
3    0.562417
4    0.458058
5   -0.565540
6    1.176102
7   -1.381781
8    0.247621
9   -0.620260
dtype: float64

In [72]:
s1.cov(s2) #korelacja <-1, 1>

0.2275013033055927

In [111]:
frame = pd.DataFrame([[1, -2, 3], [-4, 5, -6]], columns=['a', 'b', 'c'])
frame

   a  b  c
0  1 -2  3
1 -4  5 -6

In [112]:
frame.cov()

      a     b     c
a  12.5 -17.5  22.5
b -17.5  24.5 -31.5
c  22.5 -31.5  40.5

In [113]:
frame['a'].cov(frame['b'])

-17.5

In [114]:
# Korelacja
frame = pd.DataFrame(np.random.randn(10, 5), columns=['a', 'b', 'c', 'd', 'e'])
frame

          a         b         c         d         e
0  0.063447  1.491835  0.320213  0.197497 -2.219985
1 -0.662598 -0.375294  0.175534  1.291144  0.065796
2  0.952774  1.051769 -1.122508 -0.545325 -0.585098
3 -0.015111 -0.070560 -0.289309  1.634503  0.989458
4 -0.502798 -1.190841 -0.999224 -1.152689  1.737815
5 -0.432706  0.696443 -0.382491 -0.683407 -0.103447
6 -0.632415 -1.416712  0.850223  0.812526  1.104229
7 -1.959189 -0.472324 -0.589274 -0.053903  0.485073
8  0.216247 -0.181895 -0.979077 -1.961006 -0.584936
9 -1.265264 -0.387953  0.144788  0.537973  0.424100

In [115]:
frame['a'].corr(frame['b']) #zależność jest gdy <-0,7 | >0,7

0.5274179233338187

In [116]:
frame.corr(method='spearman')

          a         b         c         d         e
a  1.000000  0.709091 -0.357576 -0.357576 -0.575758
b  0.709091  1.000000 -0.115152 -0.078788 -0.842424
c -0.357576 -0.115152  1.000000  0.709091  0.066667
d -0.357576 -0.078788  0.709091  1.000000  0.248485
e -0.575758 -0.842424  0.066667  0.248485  1.000000

In [117]:
# Ranking
s = pd.Series(np.random.randn(5), index=list('abcde'))
s['d'] = s['b']
s

a   -1.369452
b   -1.657125
c   -0.389409
d   -1.657125
e    0.931246
dtype: float64

In [118]:
s.rank()

a    3.0
b    1.5
c    4.0
d    1.5
e    5.0
dtype: float64

In [119]:
s.rank(method='first')

a    3.0
b    1.0
c    4.0
d    2.0
e    5.0
dtype: float64

In [120]:
# Statystyki
d = {
    'Name': pd.Series(
        ['Tom','James','Ricky','Vin','Steve','Smith','Jack', 'Lee','David','Gasper','Betina','Andres']),
    'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
    'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [121]:
df.sum()

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [122]:
df.sum(axis=1)

0     29.23
1     29.24
2     28.98
3     25.56
4     33.20
5     33.60
6     26.80
7     37.78
8     42.98
9     34.80
10    55.10
11    49.65
dtype: float64

In [123]:
df.mean()

Age       31.833333
Rating     3.743333
dtype: float64

In [87]:
df.std() #odchylenie standardowe

Age       9.232682
Rating    0.661628
dtype: float64

In [124]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

In [125]:
df.describe(include=['object']) # object dla typu słownego, number dla typu numerycznego, all dla wszystkich

       Name
count    12
unique   12
top     Tom
freq      1

In [126]:
df.describe(include='all')

       Name        Age     Rating
count    12  12.000000  12.000000
unique   12        NaN        NaN
top     Tom        NaN        NaN
freq      1        NaN        NaN
mean    NaN  31.833333   3.743333
std     NaN   9.232682   0.661628
min     NaN  23.000000   2.560000
25%     NaN  25.000000   3.230000
50%     NaN  29.500000   3.790000
75%     NaN  35.500000   4.132500
max     NaN  51.000000   4.800000

In [127]:
# Okno czasowe
df = pd.DataFrame(np.random.randn(10, 4), index = pd.date_range('21/10/2021', periods=10),columns = ['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2021-10-21 -0.951569 -0.023824 -0.630106  0.540103
2021-10-22  0.593634  0.062125  0.933198 -1.465159
2021-10-23  0.291091  0.201176  1.144062 -0.331984
2021-10-24 -0.942695 -0.325974  0.850329 -1.235270
2021-10-25  0.034313 -1.122155  1.372275  0.618982
2021-10-26  0.595331 -1.573774  1.664595 -0.665939
2021-10-27 -1.805750  0.091402  0.872497 -0.594182
2021-10-28  0.116028 -0.228222  0.048065 -1.902087
2021-10-29  1.442825  0.362091  1.224006  1.939033
2021-10-30 -0.390491  0.226192  0.560582  1.228091

In [94]:
df.rolling(window=2).mean()

                   A         B         C         D
2020-09-08       NaN       NaN       NaN       NaN
2020-09-09 -0.797345  0.113941 -0.653907 -0.068781
2020-09-10 -0.439652  0.528346 -0.135232 -0.768805
2020-09-11  0.025603  0.177221 -0.303631 -0.067852
2020-09-12 -0.691178 -0.604657 -1.145705  0.330448
2020-09-13 -1.582121 -1.110673 -0.580616 -0.432367
2020-09-14 -0.744274 -1.085875 -0.552711  0.261191
2020-09-15 -0.685574 -0.337589 -0.490260  0.573543
2020-09-16  0.125141  0.230712  0.427984 -0.505220
2020-09-17  0.144644 -0.741259  0.817714 -0.411948

In [93]:
df.expanding(min_periods=3).mean()

                   A         B         C         D
2020-09-08       NaN       NaN       NaN       NaN
2020-09-09       NaN       NaN       NaN       NaN
2020-09-10 -0.733705  0.176422 -0.274762 -0.221724
2020-09-11 -0.385871  0.145581 -0.478769 -0.068317
2020-09-12 -0.716694 -0.136009 -0.623139 -0.000856
2020-09-13 -0.784621 -0.273170 -0.512718 -0.189667
2020-09-14 -0.724574 -0.407400 -0.603017  0.074015
2020-09-15 -0.759859 -0.289275 -0.507103  0.001136
2020-09-16 -0.535748 -0.265597 -0.373905 -0.054704
2020-09-17 -0.578959 -0.379672 -0.242140 -0.081481